zhengwang721/ASF/sam0/utils/cmsis/samb11/include/pio/pio_btlc1000wlcsp.h
/**
 * \file
 *
 * \brief Peripheral I/O description for BTLC1000WLCSP
 *
 * Copyright (c) 2016 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _BTLC1000WLCSP_PIO_
#define _BTLC1000WLCSP_PIO_

#define GPIO_LP_GPIO_0           (1u << 0)  /**< \brief Pin Controlled by LP_GPIO_0 */
#define GPIO_LP_GPIO_0_IDX               0 
#define GPIO_LP_GPIO_1           (1u << 1)  /**< \brief Pin Controlled by LP_GPIO_1 */
#define GPIO_LP_GPIO_1_IDX               1 
#define GPIO_LP_GPIO_2           (1u << 2)  /**< \brief Pin Controlled by LP_GPIO_2 */
#define GPIO_LP_GPIO_2_IDX               2 
#define GPIO_LP_GPIO_3           (1u << 3)  /**< \brief Pin Controlled by LP_GPIO_3 */
#define GPIO_LP_GPIO_3_IDX               3 
#define GPIO_LP_GPIO_8           (1u << 8)  /**< \brief Pin Controlled by LP_GPIO_8 */
#define GPIO_LP_GPIO_8_IDX               8 
#define GPIO_LP_GPIO_9           (1u << 9)  /**< \brief Pin Controlled by LP_GPIO_9 */
#define GPIO_LP_GPIO_9_IDX               9 
#define GPIO_LP_GPIO_10          (1u << 10) /**< \brief Pin Controlled by LP_GPIO_10 */
#define GPIO_LP_GPIO_10_IDX              10
#define GPIO_LP_GPIO_11          (1u << 11) /**< \brief Pin Controlled by LP_GPIO_11 */
#define GPIO_LP_GPIO_11_IDX              11
#define GPIO_LP_GPIO_12          (1u << 12) /**< \brief Pin Controlled by LP_GPIO_12 */
#define GPIO_LP_GPIO_12_IDX              12
#define GPIO_LP_GPIO_13          (1u << 13) /**< \brief Pin Controlled by LP_GPIO_13 */
#define GPIO_LP_GPIO_13_IDX              13
#define GPIO_AO_GPIO_0           (1u << 15) /**< \brief Pin Controlled by AO_GPIO_0 */
#define GPIO_AO_GPIO_0_IDX               31
#define GPIO_GPIO_MS1            (1u << 15) /**< \brief Pin Controlled by GPIO_MS1 */
#define GPIO_GPIO_MS1_IDX                47

/* PinMux definitions                                               */
/* Mux values for LP_GPIO_0 */
#define MUX_LP_GPIO_0_MUX6                     0x6
#define MUX_LP_GPIO_0_MUX7                     0x7
#define MUX_LP_GPIO_0_MUX4                     0x4
#define MUX_LP_GPIO_0_MUX5                     0x5
#define MUX_LP_GPIO_0_MUX2                     0x2
#define MUX_LP_GPIO_0_MUX3                     0x3
#define MUX_LP_GPIO_0_MUX0                     0x0
#define MUX_LP_GPIO_0_MUX1                     0x1
/* Mux values for LP_GPIO_1 */
#define MUX_LP_GPIO_1_MUX6                     0x6
#define MUX_LP_GPIO_1_MUX7                     0x7
#define MUX_LP_GPIO_1_MUX4                     0x4
#define MUX_LP_GPIO_1_MUX5                     0x5
#define MUX_LP_GPIO_1_MUX2                     0x2
#define MUX_LP_GPIO_1_MUX3                     0x3
#define MUX_LP_GPIO_1_MUX0                     0x0
#define MUX_LP_GPIO_1_MUX1                     0x1
/* Mux values for LP_GPIO_2 */
#define MUX_LP_GPIO_2_MUX6                     0x6
#define MUX_LP_GPIO_2_MUX7                     0x7
#define MUX_LP_GPIO_2_MUX4                     0x4
#define MUX_LP_GPIO_2_MUX5                     0x5
#define MUX_LP_GPIO_2_MUX2                     0x2
#define MUX_LP_GPIO_2_MUX3                     0x3
#define MUX_LP_GPIO_2_MUX0                     0x0
#define MUX_LP_GPIO_2_MUX1                     0x1
/* Mux values for LP_GPIO_3 */
#define MUX_LP_GPIO_3_MUX6                     0x6
#define MUX_LP_GPIO_3_MUX7                     0x7
#define MUX_LP_GPIO_3_MUX4                     0x4
#define MUX_LP_GPIO_3_MUX5                     0x5
#define MUX_LP_GPIO_3_MUX2                     0x2
#define MUX_LP_GPIO_3_MUX3                     0x3
#define MUX_LP_GPIO_3_MUX0                     0x0
#define MUX_LP_GPIO_3_MUX1                     0x1
/* Mux values for LP_GPIO_8 */
#define MUX_LP_GPIO_8_MUX6                     0x6
#define MUX_LP_GPIO_8_MUX7                     0x7
#define MUX_LP_GPIO_8_MUX4                     0x4
#define MUX_LP_GPIO_8_MUX5                     0x5
#define MUX_LP_GPIO_8_MUX2                     0x2
#define MUX_LP_GPIO_8_MUX3                     0x3
#define MUX_LP_GPIO_8_MUX0                     0x0
#define MUX_LP_GPIO_8_MUX1                     0x1
/* Mux values for LP_GPIO_9 */
#define MUX_LP_GPIO_9_MUX6                     0x6
#define MUX_LP_GPIO_9_MUX7                     0x7
#define MUX_LP_GPIO_9_MUX4                     0x4
#define MUX_LP_GPIO_9_MUX5                     0x5
#define MUX_LP_GPIO_9_MUX2                     0x2
#define MUX_LP_GPIO_9_MUX3                     0x3
#define MUX_LP_GPIO_9_MUX0                     0x0
#define MUX_LP_GPIO_9_MUX1                     0x1
/* Mux values for LP_GPIO_10 */
#define MUX_LP_GPIO_10_MUX6                    0x6
#define MUX_LP_GPIO_10_MUX7                    0x7
#define MUX_LP_GPIO_10_MUX4                    0x4
#define MUX_LP_GPIO_10_MUX5                    0x5
#define MUX_LP_GPIO_10_MUX2                    0x2
#define MUX_LP_GPIO_10_MUX3                    0x3
#define MUX_LP_GPIO_10_MUX0                    0x0
#define MUX_LP_GPIO_10_MUX1                    0x1
/* Mux values for LP_GPIO_11 */
#define MUX_LP_GPIO_11_MUX6                    0x6
#define MUX_LP_GPIO_11_MUX7                    0x7
#define MUX_LP_GPIO_11_MUX4                    0x4
#define MUX_LP_GPIO_11_MUX5                    0x5
#define MUX_LP_GPIO_11_MUX2                    0x2
#define MUX_LP_GPIO_11_MUX3                    0x3
#define MUX_LP_GPIO_11_MUX0                    0x0
#define MUX_LP_GPIO_11_MUX1                    0x1
/* Mux values for LP_GPIO_12 */
#define MUX_LP_GPIO_12_MUX6                    0x6
#define MUX_LP_GPIO_12_MUX7                    0x7
#define MUX_LP_GPIO_12_MUX4                    0x4
#define MUX_LP_GPIO_12_MUX5                    0x5
#define MUX_LP_GPIO_12_MUX2                    0x2
#define MUX_LP_GPIO_12_MUX3                    0x3
#define MUX_LP_GPIO_12_MUX0                    0x0
#define MUX_LP_GPIO_12_MUX1                    0x1
/* Mux values for LP_GPIO_13 */
#define MUX_LP_GPIO_13_MUX6                    0x6
#define MUX_LP_GPIO_13_MUX7                    0x7
#define MUX_LP_GPIO_13_MUX4                    0x4
#define MUX_LP_GPIO_13_MUX5                    0x5
#define MUX_LP_GPIO_13_MUX2                    0x2
#define MUX_LP_GPIO_13_MUX3                    0x3
#define MUX_LP_GPIO_13_MUX0                    0x0
#define MUX_LP_GPIO_13_MUX1                    0x1

