zhengwang721/ASF/sam0/utils/cmsis/samb11/include/pio/pio_btlc1000wlcsp.h
/* MegaMux definitions                                              */
/* MegaMux values for LP_GPIO_0 */
#define MEGAMUX_LP_GPIO_0_24                       0x18
#define MEGAMUX_LP_GPIO_0_25                       0x19
#define MEGAMUX_LP_GPIO_0_26                       0x1a
#define MEGAMUX_LP_GPIO_0_27                       0x1b
#define MEGAMUX_LP_GPIO_0_20                       0x14
#define MEGAMUX_LP_GPIO_0_21                       0x15
#define MEGAMUX_LP_GPIO_0_22                       0x16
#define MEGAMUX_LP_GPIO_0_23                       0x17
#define MEGAMUX_LP_GPIO_0_28                       0x1c
#define MEGAMUX_LP_GPIO_0_29                       0x1d
#define MEGAMUX_LP_GPIO_0_1                        0x1
#define MEGAMUX_LP_GPIO_0_0                        0x0
#define MEGAMUX_LP_GPIO_0_3                        0x3
#define MEGAMUX_LP_GPIO_0_2                        0x2
#define MEGAMUX_LP_GPIO_0_5                        0x5
#define MEGAMUX_LP_GPIO_0_4                        0x4
#define MEGAMUX_LP_GPIO_0_7                        0x7
#define MEGAMUX_LP_GPIO_0_6                        0x6
#define MEGAMUX_LP_GPIO_0_9                        0x9
#define MEGAMUX_LP_GPIO_0_8                        0x8
#define MEGAMUX_LP_GPIO_0_11                       0xb
#define MEGAMUX_LP_GPIO_0_10                       0xa
#define MEGAMUX_LP_GPIO_0_13                       0xd
#define MEGAMUX_LP_GPIO_0_12                       0xc
#define MEGAMUX_LP_GPIO_0_15                       0xf
#define MEGAMUX_LP_GPIO_0_14                       0xe
#define MEGAMUX_LP_GPIO_0_17                       0x11
#define MEGAMUX_LP_GPIO_0_16                       0x10
#define MEGAMUX_LP_GPIO_0_19                       0x13
#define MEGAMUX_LP_GPIO_0_18                       0x12
#define MEGAMUX_LP_GPIO_0_31                       0x1f
#define MEGAMUX_LP_GPIO_0_30                       0x1e
#define MEGAMUX_LP_GPIO_0_34                       0x22
#define MEGAMUX_LP_GPIO_0_33                       0x21
#define MEGAMUX_LP_GPIO_0_32                       0x20
/* MegaMux values for LP_GPIO_1 */
#define MEGAMUX_LP_GPIO_1_24                       0x18
#define MEGAMUX_LP_GPIO_1_25                       0x19
#define MEGAMUX_LP_GPIO_1_26                       0x1a
#define MEGAMUX_LP_GPIO_1_27                       0x1b
#define MEGAMUX_LP_GPIO_1_20                       0x14
#define MEGAMUX_LP_GPIO_1_21                       0x15
#define MEGAMUX_LP_GPIO_1_22                       0x16
#define MEGAMUX_LP_GPIO_1_23                       0x17
#define MEGAMUX_LP_GPIO_1_28                       0x1c
#define MEGAMUX_LP_GPIO_1_29                       0x1d
#define MEGAMUX_LP_GPIO_1_1                        0x1
#define MEGAMUX_LP_GPIO_1_0                        0x0
#define MEGAMUX_LP_GPIO_1_3                        0x3
#define MEGAMUX_LP_GPIO_1_2                        0x2
#define MEGAMUX_LP_GPIO_1_5                        0x5
#define MEGAMUX_LP_GPIO_1_4                        0x4
#define MEGAMUX_LP_GPIO_1_7                        0x7
#define MEGAMUX_LP_GPIO_1_6                        0x6
#define MEGAMUX_LP_GPIO_1_9                        0x9
#define MEGAMUX_LP_GPIO_1_8                        0x8
#define MEGAMUX_LP_GPIO_1_11                       0xb
#define MEGAMUX_LP_GPIO_1_10                       0xa
#define MEGAMUX_LP_GPIO_1_13                       0xd
#define MEGAMUX_LP_GPIO_1_12                       0xc
#define MEGAMUX_LP_GPIO_1_15                       0xf
#define MEGAMUX_LP_GPIO_1_14                       0xe
#define MEGAMUX_LP_GPIO_1_17                       0x11
#define MEGAMUX_LP_GPIO_1_16                       0x10
#define MEGAMUX_LP_GPIO_1_19                       0x13
#define MEGAMUX_LP_GPIO_1_18                       0x12
#define MEGAMUX_LP_GPIO_1_31                       0x1f
#define MEGAMUX_LP_GPIO_1_30                       0x1e
#define MEGAMUX_LP_GPIO_1_34                       0x22
#define MEGAMUX_LP_GPIO_1_33                       0x21
#define MEGAMUX_LP_GPIO_1_32                       0x20
/* MegaMux values for LP_GPIO_2 */
#define MEGAMUX_LP_GPIO_2_24                       0x18
#define MEGAMUX_LP_GPIO_2_25                       0x19
#define MEGAMUX_LP_GPIO_2_26                       0x1a
#define MEGAMUX_LP_GPIO_2_27                       0x1b
#define MEGAMUX_LP_GPIO_2_20                       0x14
#define MEGAMUX_LP_GPIO_2_21                       0x15
#define MEGAMUX_LP_GPIO_2_22                       0x16
#define MEGAMUX_LP_GPIO_2_23                       0x17
#define MEGAMUX_LP_GPIO_2_28                       0x1c
#define MEGAMUX_LP_GPIO_2_29                       0x1d
#define MEGAMUX_LP_GPIO_2_1                        0x1
#define MEGAMUX_LP_GPIO_2_0                        0x0
#define MEGAMUX_LP_GPIO_2_3                        0x3
#define MEGAMUX_LP_GPIO_2_2                        0x2
#define MEGAMUX_LP_GPIO_2_5                        0x5
#define MEGAMUX_LP_GPIO_2_4                        0x4
#define MEGAMUX_LP_GPIO_2_7                        0x7
#define MEGAMUX_LP_GPIO_2_6                        0x6
#define MEGAMUX_LP_GPIO_2_9                        0x9
#define MEGAMUX_LP_GPIO_2_8                        0x8
#define MEGAMUX_LP_GPIO_2_11                       0xb
#define MEGAMUX_LP_GPIO_2_10                       0xa
#define MEGAMUX_LP_GPIO_2_13                       0xd
#define MEGAMUX_LP_GPIO_2_12                       0xc
#define MEGAMUX_LP_GPIO_2_15                       0xf
#define MEGAMUX_LP_GPIO_2_14                       0xe
#define MEGAMUX_LP_GPIO_2_17                       0x11
#define MEGAMUX_LP_GPIO_2_16                       0x10
#define MEGAMUX_LP_GPIO_2_19                       0x13
#define MEGAMUX_LP_GPIO_2_18                       0x12
#define MEGAMUX_LP_GPIO_2_31                       0x1f
#define MEGAMUX_LP_GPIO_2_30                       0x1e
#define MEGAMUX_LP_GPIO_2_34                       0x22
#define MEGAMUX_LP_GPIO_2_33                       0x21
#define MEGAMUX_LP_GPIO_2_32                       0x20
/* MegaMux values for LP_GPIO_3 */
#define MEGAMUX_LP_GPIO_3_24                       0x18
#define MEGAMUX_LP_GPIO_3_25                       0x19
#define MEGAMUX_LP_GPIO_3_26                       0x1a
#define MEGAMUX_LP_GPIO_3_27                       0x1b
#define MEGAMUX_LP_GPIO_3_20                       0x14
#define MEGAMUX_LP_GPIO_3_21                       0x15
#define MEGAMUX_LP_GPIO_3_22                       0x16
#define MEGAMUX_LP_GPIO_3_23                       0x17
#define MEGAMUX_LP_GPIO_3_28                       0x1c
#define MEGAMUX_LP_GPIO_3_29                       0x1d
#define MEGAMUX_LP_GPIO_3_1                        0x1
#define MEGAMUX_LP_GPIO_3_0                        0x0
#define MEGAMUX_LP_GPIO_3_3                        0x3
#define MEGAMUX_LP_GPIO_3_2                        0x2
#define MEGAMUX_LP_GPIO_3_5                        0x5
#define MEGAMUX_LP_GPIO_3_4                        0x4
#define MEGAMUX_LP_GPIO_3_7                        0x7
#define MEGAMUX_LP_GPIO_3_6                        0x6
#define MEGAMUX_LP_GPIO_3_9                        0x9
#define MEGAMUX_LP_GPIO_3_8                        0x8
#define MEGAMUX_LP_GPIO_3_11                       0xb
#define MEGAMUX_LP_GPIO_3_10                       0xa
#define MEGAMUX_LP_GPIO_3_13                       0xd
#define MEGAMUX_LP_GPIO_3_12                       0xc
#define MEGAMUX_LP_GPIO_3_15                       0xf
#define MEGAMUX_LP_GPIO_3_14                       0xe
#define MEGAMUX_LP_GPIO_3_17                       0x11
#define MEGAMUX_LP_GPIO_3_16                       0x10
#define MEGAMUX_LP_GPIO_3_19                       0x13
#define MEGAMUX_LP_GPIO_3_18                       0x12
#define MEGAMUX_LP_GPIO_3_31                       0x1f
#define MEGAMUX_LP_GPIO_3_30                       0x1e
#define MEGAMUX_LP_GPIO_3_34                       0x22
#define MEGAMUX_LP_GPIO_3_33                       0x21
#define MEGAMUX_LP_GPIO_3_32                       0x20
/* MegaMux values for LP_GPIO_8 */
#define MEGAMUX_LP_GPIO_8_24                       0x18
#define MEGAMUX_LP_GPIO_8_25                       0x19
#define MEGAMUX_LP_GPIO_8_26                       0x1a
#define MEGAMUX_LP_GPIO_8_27                       0x1b
#define MEGAMUX_LP_GPIO_8_20                       0x14
#define MEGAMUX_LP_GPIO_8_21                       0x15
#define MEGAMUX_LP_GPIO_8_22                       0x16
#define MEGAMUX_LP_GPIO_8_23                       0x17
#define MEGAMUX_LP_GPIO_8_28                       0x1c
#define MEGAMUX_LP_GPIO_8_29                       0x1d
#define MEGAMUX_LP_GPIO_8_1                        0x1
#define MEGAMUX_LP_GPIO_8_0                        0x0
#define MEGAMUX_LP_GPIO_8_3                        0x3
#define MEGAMUX_LP_GPIO_8_2                        0x2
#define MEGAMUX_LP_GPIO_8_5                        0x5
#define MEGAMUX_LP_GPIO_8_4                        0x4
#define MEGAMUX_LP_GPIO_8_7                        0x7
#define MEGAMUX_LP_GPIO_8_6                        0x6
#define MEGAMUX_LP_GPIO_8_9                        0x9
#define MEGAMUX_LP_GPIO_8_8                        0x8
#define MEGAMUX_LP_GPIO_8_11                       0xb
#define MEGAMUX_LP_GPIO_8_10                       0xa
#define MEGAMUX_LP_GPIO_8_13                       0xd
#define MEGAMUX_LP_GPIO_8_12                       0xc
#define MEGAMUX_LP_GPIO_8_15                       0xf
#define MEGAMUX_LP_GPIO_8_14                       0xe
#define MEGAMUX_LP_GPIO_8_17                       0x11
#define MEGAMUX_LP_GPIO_8_16                       0x10
#define MEGAMUX_LP_GPIO_8_19                       0x13
#define MEGAMUX_LP_GPIO_8_18                       0x12
#define MEGAMUX_LP_GPIO_8_31                       0x1f
#define MEGAMUX_LP_GPIO_8_30                       0x1e
#define MEGAMUX_LP_GPIO_8_34                       0x22
#define MEGAMUX_LP_GPIO_8_33                       0x21
#define MEGAMUX_LP_GPIO_8_32                       0x20
/* MegaMux values for LP_GPIO_9 */
#define MEGAMUX_LP_GPIO_9_24                       0x18
#define MEGAMUX_LP_GPIO_9_25                       0x19
#define MEGAMUX_LP_GPIO_9_26                       0x1a
#define MEGAMUX_LP_GPIO_9_27                       0x1b
#define MEGAMUX_LP_GPIO_9_20                       0x14
#define MEGAMUX_LP_GPIO_9_21                       0x15
#define MEGAMUX_LP_GPIO_9_22                       0x16
#define MEGAMUX_LP_GPIO_9_23                       0x17
#define MEGAMUX_LP_GPIO_9_28                       0x1c
#define MEGAMUX_LP_GPIO_9_29                       0x1d
#define MEGAMUX_LP_GPIO_9_1                        0x1
#define MEGAMUX_LP_GPIO_9_0                        0x0
#define MEGAMUX_LP_GPIO_9_3                        0x3
#define MEGAMUX_LP_GPIO_9_2                        0x2
#define MEGAMUX_LP_GPIO_9_5                        0x5
#define MEGAMUX_LP_GPIO_9_4                        0x4
#define MEGAMUX_LP_GPIO_9_7                        0x7
#define MEGAMUX_LP_GPIO_9_6                        0x6
#define MEGAMUX_LP_GPIO_9_9                        0x9
#define MEGAMUX_LP_GPIO_9_8                        0x8
#define MEGAMUX_LP_GPIO_9_11                       0xb
#define MEGAMUX_LP_GPIO_9_10                       0xa
#define MEGAMUX_LP_GPIO_9_13                       0xd
#define MEGAMUX_LP_GPIO_9_12                       0xc
#define MEGAMUX_LP_GPIO_9_15                       0xf
#define MEGAMUX_LP_GPIO_9_14                       0xe
#define MEGAMUX_LP_GPIO_9_17                       0x11
#define MEGAMUX_LP_GPIO_9_16                       0x10
#define MEGAMUX_LP_GPIO_9_19                       0x13
#define MEGAMUX_LP_GPIO_9_18                       0x12
#define MEGAMUX_LP_GPIO_9_31                       0x1f
#define MEGAMUX_LP_GPIO_9_30                       0x1e
#define MEGAMUX_LP_GPIO_9_34                       0x22
#define MEGAMUX_LP_GPIO_9_33                       0x21
#define MEGAMUX_LP_GPIO_9_32                       0x20
/* MegaMux values for LP_GPIO_10 */
#define MEGAMUX_LP_GPIO_10_24                      0x18
#define MEGAMUX_LP_GPIO_10_25                      0x19
#define MEGAMUX_LP_GPIO_10_26                      0x1a
#define MEGAMUX_LP_GPIO_10_27                      0x1b
#define MEGAMUX_LP_GPIO_10_20                      0x14
#define MEGAMUX_LP_GPIO_10_21                      0x15
#define MEGAMUX_LP_GPIO_10_22                      0x16
#define MEGAMUX_LP_GPIO_10_23                      0x17
#define MEGAMUX_LP_GPIO_10_28                      0x1c
#define MEGAMUX_LP_GPIO_10_29                      0x1d
#define MEGAMUX_LP_GPIO_10_1                       0x1
#define MEGAMUX_LP_GPIO_10_0                       0x0
#define MEGAMUX_LP_GPIO_10_3                       0x3
#define MEGAMUX_LP_GPIO_10_2                       0x2
#define MEGAMUX_LP_GPIO_10_5                       0x5
#define MEGAMUX_LP_GPIO_10_4                       0x4
#define MEGAMUX_LP_GPIO_10_7                       0x7
#define MEGAMUX_LP_GPIO_10_6                       0x6
#define MEGAMUX_LP_GPIO_10_9                       0x9
#define MEGAMUX_LP_GPIO_10_8                       0x8
#define MEGAMUX_LP_GPIO_10_11                      0xb
#define MEGAMUX_LP_GPIO_10_10                      0xa
#define MEGAMUX_LP_GPIO_10_13                      0xd
#define MEGAMUX_LP_GPIO_10_12                      0xc
#define MEGAMUX_LP_GPIO_10_15                      0xf
#define MEGAMUX_LP_GPIO_10_14                      0xe
#define MEGAMUX_LP_GPIO_10_17                      0x11
#define MEGAMUX_LP_GPIO_10_16                      0x10
#define MEGAMUX_LP_GPIO_10_19                      0x13
#define MEGAMUX_LP_GPIO_10_18                      0x12
#define MEGAMUX_LP_GPIO_10_31                      0x1f
#define MEGAMUX_LP_GPIO_10_30                      0x1e
#define MEGAMUX_LP_GPIO_10_34                      0x22
#define MEGAMUX_LP_GPIO_10_33                      0x21
#define MEGAMUX_LP_GPIO_10_32                      0x20
/* MegaMux values for LP_GPIO_11 */
#define MEGAMUX_LP_GPIO_11_24                      0x18
#define MEGAMUX_LP_GPIO_11_25                      0x19
#define MEGAMUX_LP_GPIO_11_26                      0x1a
#define MEGAMUX_LP_GPIO_11_27                      0x1b
#define MEGAMUX_LP_GPIO_11_20                      0x14
#define MEGAMUX_LP_GPIO_11_21                      0x15
#define MEGAMUX_LP_GPIO_11_22                      0x16
#define MEGAMUX_LP_GPIO_11_23                      0x17
#define MEGAMUX_LP_GPIO_11_28                      0x1c
#define MEGAMUX_LP_GPIO_11_29                      0x1d
#define MEGAMUX_LP_GPIO_11_1                       0x1
#define MEGAMUX_LP_GPIO_11_0                       0x0
#define MEGAMUX_LP_GPIO_11_3                       0x3
#define MEGAMUX_LP_GPIO_11_2                       0x2
#define MEGAMUX_LP_GPIO_11_5                       0x5
#define MEGAMUX_LP_GPIO_11_4                       0x4
#define MEGAMUX_LP_GPIO_11_7                       0x7
#define MEGAMUX_LP_GPIO_11_6                       0x6
#define MEGAMUX_LP_GPIO_11_9                       0x9
#define MEGAMUX_LP_GPIO_11_8                       0x8
#define MEGAMUX_LP_GPIO_11_11                      0xb
#define MEGAMUX_LP_GPIO_11_10                      0xa
#define MEGAMUX_LP_GPIO_11_13                      0xd
#define MEGAMUX_LP_GPIO_11_12                      0xc
#define MEGAMUX_LP_GPIO_11_15                      0xf
#define MEGAMUX_LP_GPIO_11_14                      0xe
#define MEGAMUX_LP_GPIO_11_17                      0x11
#define MEGAMUX_LP_GPIO_11_16                      0x10
#define MEGAMUX_LP_GPIO_11_19                      0x13
#define MEGAMUX_LP_GPIO_11_18                      0x12
#define MEGAMUX_LP_GPIO_11_31                      0x1f
#define MEGAMUX_LP_GPIO_11_30                      0x1e
#define MEGAMUX_LP_GPIO_11_34                      0x22
#define MEGAMUX_LP_GPIO_11_33                      0x21
#define MEGAMUX_LP_GPIO_11_32                      0x20
/* MegaMux values for LP_GPIO_12 */
#define MEGAMUX_LP_GPIO_12_24                      0x18
#define MEGAMUX_LP_GPIO_12_25                      0x19
#define MEGAMUX_LP_GPIO_12_26                      0x1a
#define MEGAMUX_LP_GPIO_12_27                      0x1b
#define MEGAMUX_LP_GPIO_12_20                      0x14
#define MEGAMUX_LP_GPIO_12_21                      0x15
#define MEGAMUX_LP_GPIO_12_22                      0x16
#define MEGAMUX_LP_GPIO_12_23                      0x17
#define MEGAMUX_LP_GPIO_12_28                      0x1c
#define MEGAMUX_LP_GPIO_12_29                      0x1d
#define MEGAMUX_LP_GPIO_12_1                       0x1
#define MEGAMUX_LP_GPIO_12_0                       0x0
#define MEGAMUX_LP_GPIO_12_3                       0x3
#define MEGAMUX_LP_GPIO_12_2                       0x2
#define MEGAMUX_LP_GPIO_12_5                       0x5
#define MEGAMUX_LP_GPIO_12_4                       0x4
#define MEGAMUX_LP_GPIO_12_7                       0x7
#define MEGAMUX_LP_GPIO_12_6                       0x6
#define MEGAMUX_LP_GPIO_12_9                       0x9
#define MEGAMUX_LP_GPIO_12_8                       0x8
#define MEGAMUX_LP_GPIO_12_11                      0xb
#define MEGAMUX_LP_GPIO_12_10                      0xa
#define MEGAMUX_LP_GPIO_12_13                      0xd
#define MEGAMUX_LP_GPIO_12_12                      0xc
#define MEGAMUX_LP_GPIO_12_15                      0xf
#define MEGAMUX_LP_GPIO_12_14                      0xe
#define MEGAMUX_LP_GPIO_12_17                      0x11
#define MEGAMUX_LP_GPIO_12_16                      0x10
#define MEGAMUX_LP_GPIO_12_19                      0x13
#define MEGAMUX_LP_GPIO_12_18                      0x12
#define MEGAMUX_LP_GPIO_12_31                      0x1f
#define MEGAMUX_LP_GPIO_12_30                      0x1e
#define MEGAMUX_LP_GPIO_12_34                      0x22
#define MEGAMUX_LP_GPIO_12_33                      0x21
#define MEGAMUX_LP_GPIO_12_32                      0x20
/* MegaMux values for LP_GPIO_13 */
#define MEGAMUX_LP_GPIO_13_24                      0x18
#define MEGAMUX_LP_GPIO_13_25                      0x19
#define MEGAMUX_LP_GPIO_13_26                      0x1a
#define MEGAMUX_LP_GPIO_13_27                      0x1b
#define MEGAMUX_LP_GPIO_13_20                      0x14
#define MEGAMUX_LP_GPIO_13_21                      0x15
#define MEGAMUX_LP_GPIO_13_22                      0x16
#define MEGAMUX_LP_GPIO_13_23                      0x17
#define MEGAMUX_LP_GPIO_13_28                      0x1c
#define MEGAMUX_LP_GPIO_13_29                      0x1d
#define MEGAMUX_LP_GPIO_13_1                       0x1
#define MEGAMUX_LP_GPIO_13_0                       0x0
#define MEGAMUX_LP_GPIO_13_3                       0x3
#define MEGAMUX_LP_GPIO_13_2                       0x2
#define MEGAMUX_LP_GPIO_13_5                       0x5
#define MEGAMUX_LP_GPIO_13_4                       0x4
#define MEGAMUX_LP_GPIO_13_7                       0x7
#define MEGAMUX_LP_GPIO_13_6                       0x6
#define MEGAMUX_LP_GPIO_13_9                       0x9
#define MEGAMUX_LP_GPIO_13_8                       0x8
#define MEGAMUX_LP_GPIO_13_11                      0xb
#define MEGAMUX_LP_GPIO_13_10                      0xa
#define MEGAMUX_LP_GPIO_13_13                      0xd
#define MEGAMUX_LP_GPIO_13_12                      0xc
#define MEGAMUX_LP_GPIO_13_15                      0xf
#define MEGAMUX_LP_GPIO_13_14                      0xe
#define MEGAMUX_LP_GPIO_13_17                      0x11
#define MEGAMUX_LP_GPIO_13_16                      0x10
#define MEGAMUX_LP_GPIO_13_19                      0x13
#define MEGAMUX_LP_GPIO_13_18                      0x12
#define MEGAMUX_LP_GPIO_13_31                      0x1f
#define MEGAMUX_LP_GPIO_13_30                      0x1e
#define MEGAMUX_LP_GPIO_13_34                      0x22
#define MEGAMUX_LP_GPIO_13_33                      0x21
#define MEGAMUX_LP_GPIO_13_32                      0x20

