zhengwang721/ASF/sam0/utils/cmsis/samb11/include/pio/pio_btlc1000wlcsp.h
/* PinMux macros for LP_GPIO_0 */
#define PINMUX_LP_GPIO_0_MUX6                     ( PIN_LP_GPIO_0<<16 | MUX_LP_GPIO_0_MUX6 )
#define PINMUX_LP_GPIO_0_MUX7                     ( PIN_LP_GPIO_0<<16 | MUX_LP_GPIO_0_MUX7 )
#define PINMUX_LP_GPIO_0_MUX4                     ( PIN_LP_GPIO_0<<16 | MUX_LP_GPIO_0_MUX4 )
#define PINMUX_LP_GPIO_0_MUX5                     ( PIN_LP_GPIO_0<<16 | MUX_LP_GPIO_0_MUX5 )
#define PINMUX_LP_GPIO_0_MUX2                     ( PIN_LP_GPIO_0<<16 | MUX_LP_GPIO_0_MUX2 )
#define PINMUX_LP_GPIO_0_MUX3                     ( PIN_LP_GPIO_0<<16 | MUX_LP_GPIO_0_MUX3 )
#define PINMUX_LP_GPIO_0_MUX0                     ( PIN_LP_GPIO_0<<16 | MUX_LP_GPIO_0_MUX0 )
#define PINMUX_LP_GPIO_0_MUX1                     ( PIN_LP_GPIO_0<<16 | MUX_LP_GPIO_0_MUX1 )
/* PinMux macros for LP_GPIO_1 */
#define PINMUX_LP_GPIO_1_MUX6                     ( PIN_LP_GPIO_1<<16 | MUX_LP_GPIO_1_MUX6 )
#define PINMUX_LP_GPIO_1_MUX7                     ( PIN_LP_GPIO_1<<16 | MUX_LP_GPIO_1_MUX7 )
#define PINMUX_LP_GPIO_1_MUX4                     ( PIN_LP_GPIO_1<<16 | MUX_LP_GPIO_1_MUX4 )
#define PINMUX_LP_GPIO_1_MUX5                     ( PIN_LP_GPIO_1<<16 | MUX_LP_GPIO_1_MUX5 )
#define PINMUX_LP_GPIO_1_MUX2                     ( PIN_LP_GPIO_1<<16 | MUX_LP_GPIO_1_MUX2 )
#define PINMUX_LP_GPIO_1_MUX3                     ( PIN_LP_GPIO_1<<16 | MUX_LP_GPIO_1_MUX3 )
#define PINMUX_LP_GPIO_1_MUX0                     ( PIN_LP_GPIO_1<<16 | MUX_LP_GPIO_1_MUX0 )
#define PINMUX_LP_GPIO_1_MUX1                     ( PIN_LP_GPIO_1<<16 | MUX_LP_GPIO_1_MUX1 )
/* PinMux macros for LP_GPIO_2 */
#define PINMUX_LP_GPIO_2_MUX6                     ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_MUX6 )
#define PINMUX_LP_GPIO_2_MUX7                     ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_MUX7 )
#define PINMUX_LP_GPIO_2_MUX4                     ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_MUX4 )
#define PINMUX_LP_GPIO_2_MUX5                     ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_MUX5 )
#define PINMUX_LP_GPIO_2_MUX2                     ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_MUX2 )
#define PINMUX_LP_GPIO_2_MUX3                     ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_MUX3 )
#define PINMUX_LP_GPIO_2_MUX0                     ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_MUX0 )
#define PINMUX_LP_GPIO_2_MUX1                     ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_MUX1 )
/* PinMux macros for LP_GPIO_3 */
#define PINMUX_LP_GPIO_3_MUX6                     ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_MUX6 )
#define PINMUX_LP_GPIO_3_MUX7                     ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_MUX7 )
#define PINMUX_LP_GPIO_3_MUX4                     ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_MUX4 )
#define PINMUX_LP_GPIO_3_MUX5                     ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_MUX5 )
#define PINMUX_LP_GPIO_3_MUX2                     ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_MUX2 )
#define PINMUX_LP_GPIO_3_MUX3                     ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_MUX3 )
#define PINMUX_LP_GPIO_3_MUX0                     ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_MUX0 )
#define PINMUX_LP_GPIO_3_MUX1                     ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_MUX1 )
/* PinMux macros for LP_GPIO_8 */
#define PINMUX_LP_GPIO_8_MUX6                     ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_MUX6 )
#define PINMUX_LP_GPIO_8_MUX7                     ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_MUX7 )
#define PINMUX_LP_GPIO_8_MUX4                     ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_MUX4 )
#define PINMUX_LP_GPIO_8_MUX5                     ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_MUX5 )
#define PINMUX_LP_GPIO_8_MUX2                     ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_MUX2 )
#define PINMUX_LP_GPIO_8_MUX3                     ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_MUX3 )
#define PINMUX_LP_GPIO_8_MUX0                     ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_MUX0 )
#define PINMUX_LP_GPIO_8_MUX1                     ( PIN_LP_GPIO_8<<16 | MUX_LP_GPIO_8_MUX1 )
/* PinMux macros for LP_GPIO_9 */
#define PINMUX_LP_GPIO_9_MUX6                     ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_MUX6 )
#define PINMUX_LP_GPIO_9_MUX7                     ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_MUX7 )
#define PINMUX_LP_GPIO_9_MUX4                     ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_MUX4 )
#define PINMUX_LP_GPIO_9_MUX5                     ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_MUX5 )
#define PINMUX_LP_GPIO_9_MUX2                     ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_MUX2 )
#define PINMUX_LP_GPIO_9_MUX3                     ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_MUX3 )
#define PINMUX_LP_GPIO_9_MUX0                     ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_MUX0 )
#define PINMUX_LP_GPIO_9_MUX1                     ( PIN_LP_GPIO_9<<16 | MUX_LP_GPIO_9_MUX1 )
/* PinMux macros for LP_GPIO_10 */
#define PINMUX_LP_GPIO_10_MUX6                    ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_MUX6 )
#define PINMUX_LP_GPIO_10_MUX7                    ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_MUX7 )
#define PINMUX_LP_GPIO_10_MUX4                    ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_MUX4 )
#define PINMUX_LP_GPIO_10_MUX5                    ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_MUX5 )
#define PINMUX_LP_GPIO_10_MUX2                    ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_MUX2 )
#define PINMUX_LP_GPIO_10_MUX3                    ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_MUX3 )
#define PINMUX_LP_GPIO_10_MUX0                    ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_MUX0 )
#define PINMUX_LP_GPIO_10_MUX1                    ( PIN_LP_GPIO_10<<16 | MUX_LP_GPIO_10_MUX1 )
/* PinMux macros for LP_GPIO_11 */
#define PINMUX_LP_GPIO_11_MUX6                    ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_MUX6 )
#define PINMUX_LP_GPIO_11_MUX7                    ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_MUX7 )
#define PINMUX_LP_GPIO_11_MUX4                    ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_MUX4 )
#define PINMUX_LP_GPIO_11_MUX5                    ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_MUX5 )
#define PINMUX_LP_GPIO_11_MUX2                    ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_MUX2 )
#define PINMUX_LP_GPIO_11_MUX3                    ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_MUX3 )
#define PINMUX_LP_GPIO_11_MUX0                    ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_MUX0 )
#define PINMUX_LP_GPIO_11_MUX1                    ( PIN_LP_GPIO_11<<16 | MUX_LP_GPIO_11_MUX1 )
/* PinMux macros for LP_GPIO_12 */
#define PINMUX_LP_GPIO_12_MUX6                    ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_MUX6 )
#define PINMUX_LP_GPIO_12_MUX7                    ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_MUX7 )
#define PINMUX_LP_GPIO_12_MUX4                    ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_MUX4 )
#define PINMUX_LP_GPIO_12_MUX5                    ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_MUX5 )
#define PINMUX_LP_GPIO_12_MUX2                    ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_MUX2 )
#define PINMUX_LP_GPIO_12_MUX3                    ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_MUX3 )
#define PINMUX_LP_GPIO_12_MUX0                    ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_MUX0 )
#define PINMUX_LP_GPIO_12_MUX1                    ( PIN_LP_GPIO_12<<16 | MUX_LP_GPIO_12_MUX1 )
/* PinMux macros for LP_GPIO_13 */
#define PINMUX_LP_GPIO_13_MUX6                    ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_MUX6 )
#define PINMUX_LP_GPIO_13_MUX7                    ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_MUX7 )
#define PINMUX_LP_GPIO_13_MUX4                    ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_MUX4 )
#define PINMUX_LP_GPIO_13_MUX5                    ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_MUX5 )
#define PINMUX_LP_GPIO_13_MUX2                    ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_MUX2 )
#define PINMUX_LP_GPIO_13_MUX3                    ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_MUX3 )
#define PINMUX_LP_GPIO_13_MUX0                    ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_MUX0 )
#define PINMUX_LP_GPIO_13_MUX1                    ( PIN_LP_GPIO_13<<16 | MUX_LP_GPIO_13_MUX1 )

#endif /* _BTLC1000WLCSP_PIO_ */
